/*
编写一个函数，其作用是将输入的字符串反转过来。输入字符串以字符数组 s 的形式给出。

不要给另外的数组分配额外的空间，你必须原地修改输入数组、使用 O(1) 的额外空间解决这一问题。

 

示例 1：

输入：s = ["h","e","l","l","o"]
输出：["o","l","l","e","h"]
示例 2：

输入：s = ["H","a","n","n","a","h"]
输出：["h","a","n","n","a","H"]
*/

/*
算法一：
    该算法主要思想是，创建一个char类型变量a，然后通过字符变量a和for循环让字符串前后字符相互交换，该算法消耗时间长。
*/
void reverseString(char* s, int sSize)
{
    char a;
    int i;

    for(i = 0 ;i < sSize/2; i++)
    {
        a = s[i];
        s[i] = s[sSize-i-1];
        s[sSize-i-1] = a;
    }

    return;
}

/*
执行结果：
通过
显示详情
执行用时：
76 ms
, 在所有 C 提交中击败了
5.94%
的用户
内存消耗：
12.1 MB
, 在所有 C 提交中击败了
44.91%
的用户
通过测试用例：
477 / 477
*/